Revit 2027 API
ParameterTypeId.ElemRoomName Property
 "Room Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElemRoomName { get; }
Public Shared ReadOnly Property ElemRoomName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElemRoomName {
	ForgeTypeId^ get ();
}
static member ElemRoomName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace